app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "hey this is a test "], ["updated_at", "2018-05-29 17:10:41.298644"], ["id", 18]]

  def create
    @article = Article.new(
      title: params[:article][:title],
      body: params[:article][:body])
    @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Autocorrect destroyed my spelling ability"], ["body", "hahahahahahaah"], ["created_at", "2018-05-29 18:56:48.190415"], ["updated_at", "2018-05-29 18:56:48.190415"]]