app/controllers/tags_controller.rb

  def index
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def show
    @tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def destroy
    @tag = Tag.find(params[:id])
    @tag.destroy
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 4]]